Revit 2024 API
ElementRecord.IsCurveDriven Method
 Identifies if the element is curve driven.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public bool IsCurveDriven()
Visual Basic
Public Function IsCurveDriven As Boolean
Visual C++
public:
bool IsCurveDriven()
Return Value
 True if the element is curve driven.
See Also
ElementRecord Class
Autodesk.Revit.DB Namespace